Jiangyuejin/Note-about-learning/STM32/17-DMA数据转运/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "MyDMA.h"

uint8_t DataA[] = {0x01, 0x02, 0x03, 0x04};         //定义测试数组DataA，为数据源
uint8_t DataB[] = {0, 0, 0, 0};                     //定义测试数组DataB，为数据源目的地

int main (void)
{
    /*OLED模块初始化*/
    OLED_Init();
    //呃呃呃忘了初始化DMA
    MyDMA_Init((uint32_t)DataA, (uint32_t)DataB, 4);
    
   
    OLED_ShowString(1, 1, "DataA"); //  1行1列显示字符串
    OLED_ShowString(3, 1, "DataB"); //  3行1列显示字符串
    
    /*显示数组首地址*/
    OLED_ShowHexNum(1, 8, (uint32_t)DataA, 8);
    OLED_ShowHexNum(3, 8, (uint32_t)DataB, 8);
   
    
    while (1)
    {
        DataA[0] ++;        //变换测试数据
        DataA[1] ++;
        DataA[2] ++;
        DataA[3] ++;
        
        OLED_ShowHexNum(2, 1, DataA[0], 2);         //显示数组DataA
        OLED_ShowHexNum(2, 4, DataA[1], 2);        
        OLED_ShowHexNum(2, 7, DataA[2], 2);   
        OLED_ShowHexNum(2, 10, DataA[3], 2);    
        
        OLED_ShowHexNum(4, 1, DataB[0], 2);         //显示数组DataB
        OLED_ShowHexNum(4, 4, DataB[1], 2); 
        OLED_ShowHexNum(4, 7, DataB[2], 2); 
        OLED_ShowHexNum(4, 10, DataB[3], 2); 
        
        Delay_ms(1000);             //延时1s，观察转运现象
        
        MyDMA_Transfer();           //使用DMA转运数组， 从DataA转运到DataB
        
        OLED_ShowHexNum(2, 1, DataA[0], 2);         //显示数组DataA
        OLED_ShowHexNum(2, 4, DataA[1], 2);        
        OLED_ShowHexNum(2, 7, DataA[2], 2);   
        OLED_ShowHexNum(2, 10, DataA[3], 2);    
        
        OLED_ShowHexNum(4, 1, DataB[0], 2);         //显示数组DataB
        OLED_ShowHexNum(4, 4, DataB[1], 2); 
        OLED_ShowHexNum(4, 7, DataB[2], 2); 
        OLED_ShowHexNum(4, 10, DataB[3], 2); 
        
        Delay_ms(1000);             //延时1s，观察转运后现象
        
    }
}